# 1. Введіть з клавіатури в масив 5 цілочисельних значень. Виведіть їх в
# один рядок через кому. Отримайте для масиву середнє арифметичне.
#Курдупов Олексій 122Г
import numpy as np  # імпортуємо бібліотеку numpy.
while True:
    while True:
        Z = np.zeros(5, dtype=int)  # Ініціалізація пустої матриці.
        for i in range(len(Z)):  # Отримуємо доступ до елементів матриці Z.
            try:  # Перевірка на входження чисел.
                Z[i] = int(input(f'Число {i + 1}: '))  # Заповнюємо матрицю числами.
                continue
            except ValueError:
                print('Введіть числа! ')
                break
        print('Послідовність: ')
        for i in range(len(Z)):  # Знову отримаємо доступ до елементів матриці.
            if i == len(Z) - 1:  #Щоб вивести елементи у ряд з комами потрібно видалити останій елемент
                print(Z[i], end="\n")
            else:
                print(Z[i], end=", ")
        print(np.mean(Z))# Знаходимо середнє значення.
        result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
        if result == '1':
            continue
        else:
            break
