#17. Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
#Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
#до 200.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.uniform(100,200) for i in range(20)]) #Генеруємо масив
    print('Масив: ', Z) #Виведем
    count=0#щотчик
    for i in range(len(Z)): #проходим по елементам масиву.
        if i%2==1: #перевірка на непарні номери
            count+=Z[i] #Додамо у щотчик
    print('Сума непарних елементів: ', count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break