#16. Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
#масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(10,50) for i in range(15)])#Генеруємо масив
    print('Масив: ', Z)
    count=1 #щотчик
    for i in range(len(Z)): #проходимся по елементам масиву.
        if Z[i]%7==0: #Перевірка на кратність 7.
            count*=Z[i] #Якщо так, то множим його на count.
    if count==1: #Якщо count==1, то чисел,немає
        print('Чисел, кратних 7 немає!')
    else:
        print('Добуток  елементів: ', count)
        result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
        if result == '1':
            continue
        else:
            break
