#Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
#пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
    Z=np.array(range(1,11))#ініціалізуєм масив
    for y in range(10):#проходимся по масиву
      v=Z[y]**2*10/2 #шукаємо відстань
      print(f'Відстань за {y+1} сек',v)
      result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
      if result == '1':
          continue
      else:
          break