# 15. Знайти суму парних елементів масиву цілих чисел. Розмірність масиву - 20.
# Заповнення масиву здійснити випадковими числами від 100 до 200.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z = np.array([random.randint(100, 200) for i in range(20)])# Генеруємо масив
    print('Масив: ', Z)  # Виводим
    count = 0  #щотчик 
    for i in range(len(Z)):  #проходимся по лемементам масиву.
        if Z[i] % 2 == 0:  #елемент парний,додаєм у щотчик
            count += Z[i]
    print('Сума парних елементів: ', count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break

