#23. Знайти суму всіх елементів масиву цілих чисел, які менше середнього
#арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 150 до 300.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(150,300) for i in range(20)]) #Генеруємо масив
    print('Масив: ',Z)
    a=np.mean(Z) #середнє значення масиву.
    print('Середнє значення усіх елементів масиву: ', a)
    count=0#щотчик
    for i in range(len(Z)): #проходимо по елементам масиву.
        if Z[i]<a: #Якщо елемент менше, ніж середнє значення
            count+=Z[i] #додаємо елемент у щотчик
            print(f'Числа, менші від {a} - {Z[i]}.')
    print('Знайдемо суму цих чисел: ')
    print(f'Сума елементів, менших від {a} - {count}.')
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break