#21. Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
#числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
#від 50 до 100.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    while True:
        Z=np.array([random.uniform(50,100) for i in range(10)])#Генеруємо масив
        print('Масив: ', Z) #Виведемо
        try:
            a=int(input('Задайте число більше 50: '))
        except ValueError:
            print('Ведіть число ')
            break
        count=1 #щотчик-1 для добутоу чисел.
        for i in range(len(Z)):
            if Z[i]<a: #Якщо елемент менше
                count*=Z[i] #Множмо цей елемент.
        print(f'Знайдемо добуток чисел, менших від {a}.')
        #Якщо count==1, то чисел, що менші, ніж "задане число" не зустрілось.
        if count==1: #Якщо щотчик =1 то менші чисел не було
            print(f'Немає чисел у масиві, менших, ніж {a}.')
        else:
            print(f'Добуток чисел, які менші {a} буде {count}.')
        result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
        if result == '1':
            continue
        else:
            break