# 29. Знайти кількість парних елементів одновимірного масиву до першого
#зустрінутого числа рівного наперед заданому числу а.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
    Z=np.zeros(5,dtype=int)#ніціалізуєм масив
    count=0
    a=int(input('Введіть число: '))
    for i in range(5):#проходимся по елементам масиву
      Z[i] = int(input('Введіть елементи масива:'))
    print(Z)
    for k in range(5):#проходимся по елементам масиву
       if Z[k]%2==0: #якщо діляться на 2
           if Z[k]==a:#якщо = а виходим з циклу
               break
           else:
               count+=1#+1
    print(f'Кількість парних елементів {a}',count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break