# 2. Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
#екран значення коріння і квадратів кожного з елементів масиву.
#Курдупов Олексій 122Г
import numpy as np#імпортуємо Бібліотеку numpy .
while True:
    Z=np.zeros(5,dtype=int)#ініціалізуєм матрицю
    a=[]#пустий список для масиву
    a1=[]
    for i in range(5):#проходимся по елементам матриці
      Z[i] = int(input('Введіть елементи '))
    for k in range(5):#проходимся по елементам матриці
      b=Z[k]**2 #підносим до квадрату
      b1=Z[k]**0.5 #корінь
      a.append(b)#добавляем в список квадрат
      a1.append(b1)# добавляем в список корень
    print('Значення в квадраті',a)
    print('Корень',a1)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break