#27. Лінійний масив містить відомості про кількість опадів, що випали за
#кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
#опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
#місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.zeros(12,dtype=int)#ініціалізуєм матрицю
    count=0#щотчик
    summa=0
    for i in range(12):#проходимся по елементам матриц
      Z[i] = random.randint(10,100)#значення
    print(Z)
    min=min(Z)#мінімальне значення
    for k in range(12):
        summa+=Z[k]#обще число опадів
        if Z[k]<30:#якщо менше30 сухий місяць
            count+=1
    print('Кількість осадків',summa)
    print('Середньомісячна кількість',summa/12)
    print('Кількість засушливих місяців',count)
    print('Кількість осадків за засушливий місяць',min)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break