#Дані про направлення вітру (північний, південний, східний, західний) і
#силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
#південний вітер з силою, що перевищує 8 м / с.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(0,10) for i in range(41)])#Заповнюєм масив
    a=[]
    count=0#щотчик
    for g in range(len(Z)):#елементи масиву в список
        a.append(Z[g])
    for y in range(len(a)):#перед кожним10 вставляємо напрям вітру
        a[0]='Північний:'
        a[11]='Південний:'
        a[21]='Східний:'
        a[31]='Західний:'
    print(a)
    for o in range(len(a)):
        if 11<o<21 and a[o]>8:#По індексам вибираєм потрібний нам місяць
                count+=1
    print('Кількість днів',count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break