#Знайти суму додатніх елементів лінійного масиву цілих чисел.
#Розмірність масиву - 10. Заповнення масиву здійснити з клавіатури.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
    Z=np.zeros(5,dtype=int)#ініціалізуєм масив
    summa=0#щотчик
    for i in range(5):#проходимся по елементам масива
      Z[i] = int(input('Введіть ваші елементи '))
    print(Z)
    for y in range(5):#проходимся по елементам масива
       if Z[y]>0:
           summa+=Z[y]
    print(summa)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break