#31. Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які потрапляють в інтервал від -2 до 10.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(-4,25) for i in range(15)])#Генеруємо масив
    print('Масив: ', Z)
    count=0 #щотчик для суми
    count1=0 #щотчик
    for i in range(len(Z)): #проходимо по елементам масиву.
        if -2<=Z[i]<=10: #Пошук елемента який в інтервалі
            count+=Z[i] #Сумуємо числа.
            count1+=1 #Сумуємо кількість.
    spisok=0
    if count1==0 and count==0: #Якщо щотчик=0,чисел немає у масиві.
        print('Немає елементів у масиві від -2 до 10.')
    else: #якщо є
        spisok=count/count1
    print('Середнє значення елементів у інтервалі (-2,10): ', spisok)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break