#39. Дані про температуру повітря і кількості опадів за декаду квітня
#зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
#вигляді снігу за цю декаду.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(-10,20) for i in range(10)])#Генеруємо температуру
    X=np.array([random.randint(1,10) for i in range(10)])#Генеруємо опади
    print('Температура: ', Z)
    print('Кількість опадів: ', X)
    count=0#щотчики
    count1=0
    for i in range(10):#проходимся по списку
        if Z[i]>=0: # температура буде більшою, ніж 0:
            count1+=X[i] #додаємо у щотчик значення
        if Z[i]<0: # робим на оборот
            count+=X[i]
    print(f'Сума опадів коли температура була нижчою 0 градусів : {count}.')
    print(f'Сума опадів коли температура була вищою, 0 градусів : {count1}.')
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break
