#Обчислити суму парних елементів одновимірного масиву до першого
#зустрінутого нульового елемента.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
    Z=np.zeros(5,dtype=int)#ініціалізуєм масив
    count=0#щотчик
    for i in range(5):#проходимся по елементам масиву
      Z[i] = int(input('Введите значение'))#вводим значення
    print(Z)
    for y in range(5):#проходимся по елементам масиву
      if Z[y]%2==0:#якшо елемент парний добавляєм в шотчик ,но якщо буде 0 вихід з циклу
          if Z[y]==0:
              break
          else:
              count+=Z[y]
    print(count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break