# 4. Створіть масив з 5 прізвищ і виведіть на екран ті з них, які
# починаються з певної букви, яка вводиться з клавіатури.
#Курдупов Олексій 122Г
import numpy as np #імпортуєм бібліотеку numpy
while True:
    Z = np.array([input('Введіть прізвище: ') for i in range(5)])  # вводим прізвища
    X = input('Введіть літеру, з якої починатиметься прізвище: ')  # Введіть літеру.
    for i in Z:  # тримаємо доступ до елементів
        if i[0] == X:  # Перевірка першої букви
            print(i)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break
