#Підрахувати кількість елементів одновимірного масиву, для яких
#виконується нерівність i*i<ai<i!
#Змінній t привласнити значення істина, якщо максимальний елемент
#одновимірного масиву єдиний і не перевищує наперед заданого числа а.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import math
while True:
    Z=np.zeros(10,dtype=int)#ніціалізуєм масив
    count=0#щотчик
    for i in range(10):#проходимся по елементам масива
      Z[i] = int(input('Введите значение'))#вводим значения
    print(Z)
    for y in range(10):#проходимся по елементам масива
        if y*y<Z[y]<math.factorial(y):#Вводим нашу нерівність
            count+=1
    print(count)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break