#Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
#повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
#назву першого товару з таблиці.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
   Z = int(input("Введіть кількість товара "))
   X = np.zeros(Z, dtype=object)#ініціалізуєм масив
   count = 0#щотчик
   for i in range(Z):#Вводим елементи масивумасива
     X[i] = input("Введіть товар: ")
   print(X)
   for y in range(Z):
     if X[0] == X[y]:#скільки раз повторюється 1 товар
        count += 1
   if count > 1:#якщо більше 1 разу удаляєм
     c = X[1:len(X)]
     print("Таблиця без 1 елемента", c)
   else:
      print("Пeрший елемент один")
   result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
   if result == '1':
       continue
   else:
       break