#55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
#мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
#і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(2,6) for i in range(30)])#Генеруємо мешканців
    print('Кількість мешканців : ', Z)
    mech=Z[::-1] #пересилити мешканців за допомогою зрізу
    print('Після обміну квартирами, ', mech)
    count=0#щотчик для багодітних сімей
    for i in range(len(Z)):
        if Z[i]>5:
            count+=1
    if count==0: #Якщо 0 немає багатодітних сімей
        print('Немає квартир де проживає більше 5 мешканців.')
    else:
        print(f'Кількість квартир,де проживає більше 5 мешканців - {count}.')
        result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
        if result == '1':
            continue
        else:
            break

