#Дан одновимірний масив а. Сформувати новий масив, який складається
#тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
#елементів немає, то видати повідомлення.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
while True:
    Z=np.zeros(10,dtype=int)#ініціалізуєм масив
    for i in range(10):#проходимся по елементам масиву
      Z[i] = int(input('Введіть значення'))#вводим значения
    print(Z)
    a=[]
    for y in range(10):#Проходимся по значениям масива
        if Z[y]>y+10:#Если элемент більше свого номера на 10,+в список
         a.append(Z[y])
    if len(a)<1:#якшо список пустий таких елементів немає
        print("Таких елементів немає")
    else:
        print(a)
        result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
        if result == '1':
            continue
        else:
            break