#6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з
#елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
#елементів масиву.
#Курдупов Олексій 122Г
import numpy as np #Імпортуємо бібліотеку numpy
import random # Імпортуємо random
while True:
    Z=np.array([random.randint(-10, 10) for i in range(8)])#генеруємо масив
    print('Масив: ', Z)
    count=0 #щотчик
    for i in range(len(Z)): #проходимся по масиву .
        if Z[i]<0: #Якщо числа будуть відємними то вони врахуються
            count+=1
    print('Кількість відємних елементів: ', count)
    print()
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break
