#7. Створіть масив А [1..12] за допомогою генератора випадкових чисел з
#елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
#масиву числом.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(-20,10) for i in range(12)])#генеруємо масив
    print('Масив: ', Z)
    for i in range(len(Z)): #проходимся по масиву .
        if Z[i]<0: #Якщо число буде відємне замінюємо
            Z[i]=1
    print(Z)
    print()
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break
