#8. Створіть цілочисельний масив А [1..15] за допомогою генератора
#випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
#найбільший елемент масиву і його індекс.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array([random.randint(-15,30) for i in range(15)])#генеруємо масив
    print('Масив: ', Z)
    for i in range(len(Z)): #проходимся по масиву
        Z_max=max(Z) #найбільше значення.
        if Z_max==Z[i]: #Знаходимо число у масиві і індекс.
            print(f'Найбільший елемент: {Z_max}  індекс {i}')
            break
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break

