#9. З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
#що протягом цього часу температура знижувалася. Визначте, о котрій годині було
#вперше зафіксовано від'ємну температуру.
#Курдупов Олексій 122Г
import numpy as np #імпортуємо Бібліотеку numpy .
import random #імпортуємо random
while True:
    Z=np.array(range(8,21)) # матриця для годин
    X=np.array([random.randint(-5,5) for i in range(8,21)]) #матриця для температури.
    print('Години: ', Z)
    print('Температура: ', X)
    for i in range(len(X)): #проходимся по елементам матриці X.
        if X[i]>=0: #не враховуємо додатню температуру
            continue
        else:
            print(f"Температура знизилась до {X[i]} у {i+8} годин.")
        break
    result = input('Хочите продовжити ? Якщо да - 1, Якщо нет - інше: ')
    if result == '1':
        continue
    else:
        break
